/*
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * Лабораторная работа №2. Группа ПМ-01.                             *
      * Работу выполнили:                                                 *
      *   - Самсонов Семён,                                               *
      *   - Чирков Артём,                                                 *  
      *   - Александр Апрелков                                            *  
      * Вариант: 14                                                       *  
      * Цель: вычисление значения заданного интеграла по методу Симпсона  *  
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 
*/

#include <stdio.h>
#include <math.h>

int main() {
   double s = 1, s2 = 0;
   unsigned int n = 2, i;
   double a = 0, b = 1;
   double epsilon, h = 0;

   scanf_s("%lf", &epsilon);

   do {
      h = (b - a) / n;
      i = 1;
      s2 = s; 
      s = 1 + 4*((1 / (1 + (n - 1) * h + a))) + 0.5;
      
      while(i <= n - 2) {
         s += (1 / (1 + i * h + a)) * 4 + (1 / (1 + (i + 1) * h + a)) * 2;
         
         i += 2;
      };
      n *= 2;
      s *= h / 3;

   } while (fabs(s - s2) > epsilon);

   printf("%lf\n", s);

   return 0;
}